GopalSaraf/Practicals/PSDL/include/proc/pic18f248.inc
// Register: RXF1SIDH
#define RXF1SIDH RXF1SIDH
RXF1SIDH                                 equ 0F04h
// bitfield definitions
RXF1SIDH_SID3_POSN                       equ 0000h
RXF1SIDH_SID3_POSITION                   equ 0000h
RXF1SIDH_SID3_SIZE                       equ 0001h
RXF1SIDH_SID3_LENGTH                     equ 0001h
RXF1SIDH_SID3_MASK                       equ 0001h
RXF1SIDH_SID4_POSN                       equ 0001h
RXF1SIDH_SID4_POSITION                   equ 0001h
RXF1SIDH_SID4_SIZE                       equ 0001h
RXF1SIDH_SID4_LENGTH                     equ 0001h
RXF1SIDH_SID4_MASK                       equ 0002h
RXF1SIDH_SID5_POSN                       equ 0002h
RXF1SIDH_SID5_POSITION                   equ 0002h
RXF1SIDH_SID5_SIZE                       equ 0001h
RXF1SIDH_SID5_LENGTH                     equ 0001h
RXF1SIDH_SID5_MASK                       equ 0004h
RXF1SIDH_SID6_POSN                       equ 0003h
RXF1SIDH_SID6_POSITION                   equ 0003h
RXF1SIDH_SID6_SIZE                       equ 0001h
RXF1SIDH_SID6_LENGTH                     equ 0001h
RXF1SIDH_SID6_MASK                       equ 0008h
RXF1SIDH_SID7_POSN                       equ 0004h
RXF1SIDH_SID7_POSITION                   equ 0004h
RXF1SIDH_SID7_SIZE                       equ 0001h
RXF1SIDH_SID7_LENGTH                     equ 0001h
RXF1SIDH_SID7_MASK                       equ 0010h
RXF1SIDH_SID8_POSN                       equ 0005h
RXF1SIDH_SID8_POSITION                   equ 0005h
RXF1SIDH_SID8_SIZE                       equ 0001h
RXF1SIDH_SID8_LENGTH                     equ 0001h
RXF1SIDH_SID8_MASK                       equ 0020h
RXF1SIDH_SID9_POSN                       equ 0006h
RXF1SIDH_SID9_POSITION                   equ 0006h
RXF1SIDH_SID9_SIZE                       equ 0001h
RXF1SIDH_SID9_LENGTH                     equ 0001h
RXF1SIDH_SID9_MASK                       equ 0040h
RXF1SIDH_SID10_POSN                      equ 0007h
RXF1SIDH_SID10_POSITION                  equ 0007h
RXF1SIDH_SID10_SIZE                      equ 0001h
RXF1SIDH_SID10_LENGTH                    equ 0001h
RXF1SIDH_SID10_MASK                      equ 0080h
RXF1SIDH_RXF1SID3_POSN                   equ 0000h
RXF1SIDH_RXF1SID3_POSITION               equ 0000h
RXF1SIDH_RXF1SID3_SIZE                   equ 0001h
RXF1SIDH_RXF1SID3_LENGTH                 equ 0001h
RXF1SIDH_RXF1SID3_MASK                   equ 0001h
RXF1SIDH_RXF1SID4_POSN                   equ 0001h
RXF1SIDH_RXF1SID4_POSITION               equ 0001h
RXF1SIDH_RXF1SID4_SIZE                   equ 0001h
RXF1SIDH_RXF1SID4_LENGTH                 equ 0001h
RXF1SIDH_RXF1SID4_MASK                   equ 0002h
RXF1SIDH_RXF1SID5_POSN                   equ 0002h
RXF1SIDH_RXF1SID5_POSITION               equ 0002h
RXF1SIDH_RXF1SID5_SIZE                   equ 0001h
RXF1SIDH_RXF1SID5_LENGTH                 equ 0001h
RXF1SIDH_RXF1SID5_MASK                   equ 0004h
RXF1SIDH_RXF1SID6_POSN                   equ 0003h
RXF1SIDH_RXF1SID6_POSITION               equ 0003h
RXF1SIDH_RXF1SID6_SIZE                   equ 0001h
RXF1SIDH_RXF1SID6_LENGTH                 equ 0001h
RXF1SIDH_RXF1SID6_MASK                   equ 0008h
RXF1SIDH_RXF1SID7_POSN                   equ 0004h
RXF1SIDH_RXF1SID7_POSITION               equ 0004h
RXF1SIDH_RXF1SID7_SIZE                   equ 0001h
RXF1SIDH_RXF1SID7_LENGTH                 equ 0001h
RXF1SIDH_RXF1SID7_MASK                   equ 0010h
RXF1SIDH_RXF1SID8_POSN                   equ 0005h
RXF1SIDH_RXF1SID8_POSITION               equ 0005h
RXF1SIDH_RXF1SID8_SIZE                   equ 0001h
RXF1SIDH_RXF1SID8_LENGTH                 equ 0001h
RXF1SIDH_RXF1SID8_MASK                   equ 0020h
RXF1SIDH_RXF1SID9_POSN                   equ 0006h
RXF1SIDH_RXF1SID9_POSITION               equ 0006h
RXF1SIDH_RXF1SID9_SIZE                   equ 0001h
RXF1SIDH_RXF1SID9_LENGTH                 equ 0001h
RXF1SIDH_RXF1SID9_MASK                   equ 0040h
RXF1SIDH_RXF1SID10_POSN                  equ 0007h
RXF1SIDH_RXF1SID10_POSITION              equ 0007h
RXF1SIDH_RXF1SID10_SIZE                  equ 0001h
RXF1SIDH_RXF1SID10_LENGTH                equ 0001h
RXF1SIDH_RXF1SID10_MASK                  equ 0080h

// Register: RXF1SIDL
#define RXF1SIDL RXF1SIDL
RXF1SIDL                                 equ 0F05h
// bitfield definitions
RXF1SIDL_EID16_POSN                      equ 0000h
RXF1SIDL_EID16_POSITION                  equ 0000h
RXF1SIDL_EID16_SIZE                      equ 0001h
RXF1SIDL_EID16_LENGTH                    equ 0001h
RXF1SIDL_EID16_MASK                      equ 0001h
RXF1SIDL_EID17_POSN                      equ 0001h
RXF1SIDL_EID17_POSITION                  equ 0001h
RXF1SIDL_EID17_SIZE                      equ 0001h
RXF1SIDL_EID17_LENGTH                    equ 0001h
RXF1SIDL_EID17_MASK                      equ 0002h
RXF1SIDL_EXIDEN_POSN                     equ 0003h
RXF1SIDL_EXIDEN_POSITION                 equ 0003h
RXF1SIDL_EXIDEN_SIZE                     equ 0001h
RXF1SIDL_EXIDEN_LENGTH                   equ 0001h
RXF1SIDL_EXIDEN_MASK                     equ 0008h
RXF1SIDL_SID0_POSN                       equ 0005h
RXF1SIDL_SID0_POSITION                   equ 0005h
RXF1SIDL_SID0_SIZE                       equ 0001h
RXF1SIDL_SID0_LENGTH                     equ 0001h
RXF1SIDL_SID0_MASK                       equ 0020h
RXF1SIDL_SID1_POSN                       equ 0006h
RXF1SIDL_SID1_POSITION                   equ 0006h
RXF1SIDL_SID1_SIZE                       equ 0001h
RXF1SIDL_SID1_LENGTH                     equ 0001h
RXF1SIDL_SID1_MASK                       equ 0040h
RXF1SIDL_SID2_POSN                       equ 0007h
RXF1SIDL_SID2_POSITION                   equ 0007h
RXF1SIDL_SID2_SIZE                       equ 0001h
RXF1SIDL_SID2_LENGTH                     equ 0001h
RXF1SIDL_SID2_MASK                       equ 0080h
RXF1SIDL_RXF1EID16_POSN                  equ 0000h
RXF1SIDL_RXF1EID16_POSITION              equ 0000h
RXF1SIDL_RXF1EID16_SIZE                  equ 0001h
RXF1SIDL_RXF1EID16_LENGTH                equ 0001h
RXF1SIDL_RXF1EID16_MASK                  equ 0001h
RXF1SIDL_RXF1EID17_POSN                  equ 0001h
RXF1SIDL_RXF1EID17_POSITION              equ 0001h
RXF1SIDL_RXF1EID17_SIZE                  equ 0001h
RXF1SIDL_RXF1EID17_LENGTH                equ 0001h
RXF1SIDL_RXF1EID17_MASK                  equ 0002h
RXF1SIDL_RXF1EXIDEN_POSN                 equ 0003h
RXF1SIDL_RXF1EXIDEN_POSITION             equ 0003h
RXF1SIDL_RXF1EXIDEN_SIZE                 equ 0001h
RXF1SIDL_RXF1EXIDEN_LENGTH               equ 0001h
RXF1SIDL_RXF1EXIDEN_MASK                 equ 0008h
RXF1SIDL_RXF1SID0_POSN                   equ 0005h
RXF1SIDL_RXF1SID0_POSITION               equ 0005h
RXF1SIDL_RXF1SID0_SIZE                   equ 0001h
RXF1SIDL_RXF1SID0_LENGTH                 equ 0001h
RXF1SIDL_RXF1SID0_MASK                   equ 0020h
RXF1SIDL_RXF1SID1_POSN                   equ 0006h
RXF1SIDL_RXF1SID1_POSITION               equ 0006h
RXF1SIDL_RXF1SID1_SIZE                   equ 0001h
RXF1SIDL_RXF1SID1_LENGTH                 equ 0001h
RXF1SIDL_RXF1SID1_MASK                   equ 0040h
RXF1SIDL_RXF1SID2_POSN                   equ 0007h
RXF1SIDL_RXF1SID2_POSITION               equ 0007h
RXF1SIDL_RXF1SID2_SIZE                   equ 0001h
RXF1SIDL_RXF1SID2_LENGTH                 equ 0001h
RXF1SIDL_RXF1SID2_MASK                   equ 0080h

// Register: RXF1EIDH
#define RXF1EIDH RXF1EIDH
RXF1EIDH                                 equ 0F06h
// bitfield definitions
RXF1EIDH_EID8_POSN                       equ 0000h
RXF1EIDH_EID8_POSITION                   equ 0000h
RXF1EIDH_EID8_SIZE                       equ 0001h
RXF1EIDH_EID8_LENGTH                     equ 0001h
RXF1EIDH_EID8_MASK                       equ 0001h
RXF1EIDH_EID9_POSN                       equ 0001h
RXF1EIDH_EID9_POSITION                   equ 0001h
RXF1EIDH_EID9_SIZE                       equ 0001h
RXF1EIDH_EID9_LENGTH                     equ 0001h
RXF1EIDH_EID9_MASK                       equ 0002h
RXF1EIDH_EID10_POSN                      equ 0002h
RXF1EIDH_EID10_POSITION                  equ 0002h
RXF1EIDH_EID10_SIZE                      equ 0001h
RXF1EIDH_EID10_LENGTH                    equ 0001h
RXF1EIDH_EID10_MASK                      equ 0004h
RXF1EIDH_EID11_POSN                      equ 0003h
RXF1EIDH_EID11_POSITION                  equ 0003h
RXF1EIDH_EID11_SIZE                      equ 0001h
RXF1EIDH_EID11_LENGTH                    equ 0001h
RXF1EIDH_EID11_MASK                      equ 0008h
RXF1EIDH_EID12_POSN                      equ 0004h
RXF1EIDH_EID12_POSITION                  equ 0004h
RXF1EIDH_EID12_SIZE                      equ 0001h
RXF1EIDH_EID12_LENGTH                    equ 0001h
RXF1EIDH_EID12_MASK                      equ 0010h
RXF1EIDH_EID13_POSN                      equ 0005h
RXF1EIDH_EID13_POSITION                  equ 0005h
RXF1EIDH_EID13_SIZE                      equ 0001h
RXF1EIDH_EID13_LENGTH                    equ 0001h
RXF1EIDH_EID13_MASK                      equ 0020h
RXF1EIDH_EID14_POSN                      equ 0006h
RXF1EIDH_EID14_POSITION                  equ 0006h
RXF1EIDH_EID14_SIZE                      equ 0001h
RXF1EIDH_EID14_LENGTH                    equ 0001h
RXF1EIDH_EID14_MASK                      equ 0040h
RXF1EIDH_EID15_POSN                      equ 0007h
RXF1EIDH_EID15_POSITION                  equ 0007h
RXF1EIDH_EID15_SIZE                      equ 0001h
RXF1EIDH_EID15_LENGTH                    equ 0001h
RXF1EIDH_EID15_MASK                      equ 0080h
RXF1EIDH_RXF1EID8_POSN                   equ 0000h
RXF1EIDH_RXF1EID8_POSITION               equ 0000h
RXF1EIDH_RXF1EID8_SIZE                   equ 0001h
RXF1EIDH_RXF1EID8_LENGTH                 equ 0001h
RXF1EIDH_RXF1EID8_MASK                   equ 0001h
RXF1EIDH_RXF1EID9_POSN                   equ 0001h
RXF1EIDH_RXF1EID9_POSITION               equ 0001h
RXF1EIDH_RXF1EID9_SIZE                   equ 0001h
RXF1EIDH_RXF1EID9_LENGTH                 equ 0001h
RXF1EIDH_RXF1EID9_MASK                   equ 0002h
RXF1EIDH_RXF1EID10_POSN                  equ 0002h
RXF1EIDH_RXF1EID10_POSITION              equ 0002h
RXF1EIDH_RXF1EID10_SIZE                  equ 0001h
RXF1EIDH_RXF1EID10_LENGTH                equ 0001h
RXF1EIDH_RXF1EID10_MASK                  equ 0004h
RXF1EIDH_RXF1EID11_POSN                  equ 0003h
RXF1EIDH_RXF1EID11_POSITION              equ 0003h
RXF1EIDH_RXF1EID11_SIZE                  equ 0001h
RXF1EIDH_RXF1EID11_LENGTH                equ 0001h
RXF1EIDH_RXF1EID11_MASK                  equ 0008h
RXF1EIDH_RXF1EID12_POSN                  equ 0004h
RXF1EIDH_RXF1EID12_POSITION              equ 0004h
RXF1EIDH_RXF1EID12_SIZE                  equ 0001h
RXF1EIDH_RXF1EID12_LENGTH                equ 0001h
RXF1EIDH_RXF1EID12_MASK                  equ 0010h
RXF1EIDH_RXF1EID13_POSN                  equ 0005h
RXF1EIDH_RXF1EID13_POSITION              equ 0005h
RXF1EIDH_RXF1EID13_SIZE                  equ 0001h
RXF1EIDH_RXF1EID13_LENGTH                equ 0001h
RXF1EIDH_RXF1EID13_MASK                  equ 0020h
RXF1EIDH_RXF1EID14_POSN                  equ 0006h
RXF1EIDH_RXF1EID14_POSITION              equ 0006h
RXF1EIDH_RXF1EID14_SIZE                  equ 0001h
RXF1EIDH_RXF1EID14_LENGTH                equ 0001h
RXF1EIDH_RXF1EID14_MASK                  equ 0040h
RXF1EIDH_RXF1EID15_POSN                  equ 0007h
RXF1EIDH_RXF1EID15_POSITION              equ 0007h
RXF1EIDH_RXF1EID15_SIZE                  equ 0001h
RXF1EIDH_RXF1EID15_LENGTH                equ 0001h
RXF1EIDH_RXF1EID15_MASK                  equ 0080h

// Register: RXF1EIDL
#define RXF1EIDL RXF1EIDL
RXF1EIDL                                 equ 0F07h
// bitfield definitions
RXF1EIDL_EID0_POSN                       equ 0000h
RXF1EIDL_EID0_POSITION                   equ 0000h
RXF1EIDL_EID0_SIZE                       equ 0001h
RXF1EIDL_EID0_LENGTH                     equ 0001h
RXF1EIDL_EID0_MASK                       equ 0001h
RXF1EIDL_EID1_POSN                       equ 0001h
RXF1EIDL_EID1_POSITION                   equ 0001h
RXF1EIDL_EID1_SIZE                       equ 0001h
RXF1EIDL_EID1_LENGTH                     equ 0001h
RXF1EIDL_EID1_MASK                       equ 0002h
RXF1EIDL_EID2_POSN                       equ 0002h
RXF1EIDL_EID2_POSITION                   equ 0002h
RXF1EIDL_EID2_SIZE                       equ 0001h
RXF1EIDL_EID2_LENGTH                     equ 0001h
RXF1EIDL_EID2_MASK                       equ 0004h
RXF1EIDL_EID3_POSN                       equ 0003h
RXF1EIDL_EID3_POSITION                   equ 0003h
RXF1EIDL_EID3_SIZE                       equ 0001h
RXF1EIDL_EID3_LENGTH                     equ 0001h
RXF1EIDL_EID3_MASK                       equ 0008h
RXF1EIDL_EID4_POSN                       equ 0004h
RXF1EIDL_EID4_POSITION                   equ 0004h
RXF1EIDL_EID4_SIZE                       equ 0001h
RXF1EIDL_EID4_LENGTH                     equ 0001h
RXF1EIDL_EID4_MASK                       equ 0010h
RXF1EIDL_EID5_POSN                       equ 0005h
RXF1EIDL_EID5_POSITION                   equ 0005h
RXF1EIDL_EID5_SIZE                       equ 0001h
RXF1EIDL_EID5_LENGTH                     equ 0001h
RXF1EIDL_EID5_MASK                       equ 0020h
RXF1EIDL_EID6_POSN                       equ 0006h
RXF1EIDL_EID6_POSITION                   equ 0006h
RXF1EIDL_EID6_SIZE                       equ 0001h
RXF1EIDL_EID6_LENGTH                     equ 0001h
RXF1EIDL_EID6_MASK                       equ 0040h
RXF1EIDL_EID7_POSN                       equ 0007h
RXF1EIDL_EID7_POSITION                   equ 0007h
RXF1EIDL_EID7_SIZE                       equ 0001h
RXF1EIDL_EID7_LENGTH                     equ 0001h
RXF1EIDL_EID7_MASK                       equ 0080h
RXF1EIDL_RXF1EID0_POSN                   equ 0000h
RXF1EIDL_RXF1EID0_POSITION               equ 0000h
RXF1EIDL_RXF1EID0_SIZE                   equ 0001h
RXF1EIDL_RXF1EID0_LENGTH                 equ 0001h
RXF1EIDL_RXF1EID0_MASK                   equ 0001h
RXF1EIDL_RXF1EID1_POSN                   equ 0001h
RXF1EIDL_RXF1EID1_POSITION               equ 0001h
RXF1EIDL_RXF1EID1_SIZE                   equ 0001h
RXF1EIDL_RXF1EID1_LENGTH                 equ 0001h
RXF1EIDL_RXF1EID1_MASK                   equ 0002h
RXF1EIDL_RXF1EID2_POSN                   equ 0002h
RXF1EIDL_RXF1EID2_POSITION               equ 0002h
RXF1EIDL_RXF1EID2_SIZE                   equ 0001h
RXF1EIDL_RXF1EID2_LENGTH                 equ 0001h
RXF1EIDL_RXF1EID2_MASK                   equ 0004h
RXF1EIDL_RXF1EID3_POSN                   equ 0003h
RXF1EIDL_RXF1EID3_POSITION               equ 0003h
RXF1EIDL_RXF1EID3_SIZE                   equ 0001h
RXF1EIDL_RXF1EID3_LENGTH                 equ 0001h
RXF1EIDL_RXF1EID3_MASK                   equ 0008h
RXF1EIDL_RXF1EID4_POSN                   equ 0004h
RXF1EIDL_RXF1EID4_POSITION               equ 0004h
RXF1EIDL_RXF1EID4_SIZE                   equ 0001h
RXF1EIDL_RXF1EID4_LENGTH                 equ 0001h
RXF1EIDL_RXF1EID4_MASK                   equ 0010h
RXF1EIDL_RXF1EID5_POSN                   equ 0005h
RXF1EIDL_RXF1EID5_POSITION               equ 0005h
RXF1EIDL_RXF1EID5_SIZE                   equ 0001h
RXF1EIDL_RXF1EID5_LENGTH                 equ 0001h
RXF1EIDL_RXF1EID5_MASK                   equ 0020h
RXF1EIDL_RXF1EID6_POSN                   equ 0006h
RXF1EIDL_RXF1EID6_POSITION               equ 0006h
RXF1EIDL_RXF1EID6_SIZE                   equ 0001h
RXF1EIDL_RXF1EID6_LENGTH                 equ 0001h
RXF1EIDL_RXF1EID6_MASK                   equ 0040h
RXF1EIDL_RXF1EID7_POSN                   equ 0007h
RXF1EIDL_RXF1EID7_POSITION               equ 0007h
RXF1EIDL_RXF1EID7_SIZE                   equ 0001h
RXF1EIDL_RXF1EID7_LENGTH                 equ 0001h
RXF1EIDL_RXF1EID7_MASK                   equ 0080h

